#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// 	Функция возвращает остаток по переданной номенклатуре в виде соответствия, 
// 	где ключ - склад, а значение - количество остатка на данном складе

// Параметры:
// 	Номенклатура - СправочникСсылка.Номенклатура - номенклатура, остаток которой необходимо получить
//
// Возвращаемое значение:
// 	Соответствие - Остаток по переданной номенклатуре в виде соответствия, 
// 	где ключ - склад, а значение - количество остатка на данном складе

Функция ОстатокНоменклатуры(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыНаСкладе.Склад КАК Склад,
	|	ТоварыНаСкладе.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладе.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладе.Остатки(, Номенклатура = &Номенклатура, ) КАК ТоварыНаСкладе";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Остаток = Новый Соответствие;
	Для Каждого Строка Из Результат Цикл
		Остаток.Вставить(Строка.Склад, Строка.КоличествоОстаток);
	КонецЦикла;
	Возврат Остаток;

КонецФункции


#КонецОбласти

#КонецЕсли
