//@strict-types

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Поменялась сильно цена";
	РассчитатьСуммуСтроки(ТекстПользователю, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстПользователю = "Поменялось количество";
	РассчитатьСуммуСтроки(ТекстПользователю, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Текст, Сообщение)
	Сообщение.Сумма = Сообщение.Количество * Сообщение.Цена;
	Сообщить(Текст);
	Человек = ОписаниеСотрудника();
	Сообщить(Человек.Имя);
КонецПроцедуры

Функция ОписаниеСотрудника()
	Сотрудник = Новый Структура;
	Сотрудник.Вставить("Имя", "Антон");
	Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	Сотрудник.Вставить("Стаж", 15);
	Сотрудник.Вставить("Штатный", Ложь);
	Возврат Сотрудник;
	
	//Сотрудник = Новый Соответствие;
	//Сотрудник.Вставить("Имя", "Антон");
	//Сотрудник.Вставить("ДатаРождения", ТекущаяДата());
	//Сотрудник.Вставить("Стаж", 15);
	//Сотрудник.Вставить("Штатный", Ложь);
	//Возврат Сотрудник;
	
//Сотрудник = Новый Структура("Имя, ДатаРождения, Стаж, Штатный");
	
	
	
КонецФункции